In [7]:
import pandas as pd
import numpy as np
import time


ac = pd.read_csv('F:\\study\\ml\\DataSet\\Hbc_csv\\action_train.csv')
order = pd.read_csv('F:\\study\\ml\\DataSet\\Hbc_csv\\orderFuture_train.csv')
order_his = pd.read_csv('F:\\study\\ml\\DataSet\\Hbc_csv\\orderHistory_train.csv')
comment = pd.read_csv('F:\\study\\ml\\DataSet\\Hbc_csv\\userComment_train.csv')
profile = pd.read_csv('F:\\study\\ml\\DataSet\\Hbc_csv\\userProfile_train.csv')

ac_test = pd.read_csv('F:\\study\\ml\\DataSet\\Hbc_csv\\action_test.csv')
order_test = pd.read_csv('F:\\study\\ml\\DataSet\\Hbc_csv\\orderFuture_test.csv')
order_his_test = pd.read_csv('F:\\study\\ml\\DataSet\\Hbc_csv\\orderHistory_test.csv')
comment_test = pd.read_csv('F:\\study\\ml\\DataSet\\Hbc_csv\\userComment_test.csv')
profile_test = pd.read_csv('F:\\study\\ml\\DataSet\\Hbc_csv\\test\\userProfile_test.csv')

df = pd.DataFrame({'total_bill': [16.99, 10.34, 23.68, 23.68, 24.59],
                   'tip': [1.01, 1.66, 3.50, 3.31, 3.61],
                   'sex': ['Female', 'Male', 'Male', 'Male', 'Female']})

In [2]:
ac.dtypes

userid        int64
actionType    int64
actionTime    int64
dtype: object

In [3]:
ac.index

RangeIndex(start=0, stop=1334856, step=1)

In [4]:
ac.columns

Index(['userid', 'actionType', 'actionTime'], dtype='object')

In [5]:
ac.values

array([[100000000013,            1,   1474300753],
       [100000000013,            5,   1474300763],
       [100000000013,            6,   1474300874],
       ...,
       [114999782736,            5,   1482569275],
       [114999782736,            5,   1482569355],
       [114999782736,            6,   1482569693]], dtype=int64)

In [6]:
ac.shape

(1334856, 3)

In [15]:
df.loc[1:3,['sex','total_bill']]

    sex  total_bill
1  Male       10.34
2  Male       23.68
3  Male       23.68

In [9]:
df

      sex   tip  total_bill
0  Female  1.01       16.99
1    Male  1.66       10.34
2    Male  3.50       23.68
3    Male  3.31       23.68
4  Female  3.61       24.59

In [16]:
df.loc[1:3,'sex':'total_bill']

    sex   tip  total_bill
1  Male  1.66       10.34
2  Male  3.50       23.68
3  Male  3.31       23.68

In [19]:
df.iloc[1:3,[0,2]]

    sex  total_bill
1  Male       10.34
2  Male       23.68

In [13]:
df.iloc[1:3,1:3]

    tip  total_bill
1  1.66       10.34
2  3.50       23.68

In [20]:
df.at[3,'tip']

3.31

In [23]:
df.iat[3,1]

3.31

In [25]:
df[df['sex']=='Female']

      sex   tip  total_bill
0  Female  1.01       16.99
4  Female  3.61       24.59

In [27]:
df[df['total_bill'] > 20]

      sex   tip  total_bill
2    Male  3.50       23.68
3    Male  3.31       23.68
4  Female  3.61       24.59

In [28]:
df

      sex   tip  total_bill
0  Female  1.01       16.99
1    Male  1.66       10.34
2    Male  3.50       23.68
3    Male  3.31       23.68
4  Female  3.61       24.59

In [30]:
df.query('total_bill >20')

      sex   tip  total_bill
2    Male  3.50       23.68
3    Male  3.31       23.68
4  Female  3.61       24.59

In [31]:
df[(df['sex'] == 'Female') & (df['total_bill']>20)]

      sex   tip  total_bill
4  Female  3.61       24.59

In [32]:
df[(df['sex'] == 'Female') | (df['total_bill']>20)]

      sex   tip  total_bill
0  Female  1.01       16.99
2    Male  3.50       23.68
3    Male  3.31       23.68
4  Female  3.61       24.59

In [34]:
df[-(df['sex']=='Male')]

      sex   tip  total_bill
0  Female  1.01       16.99
4  Female  3.61       24.59

In [35]:
df[-df['total_bill'].isin([21.01,23.68])]

      sex   tip  total_bill
0  Female  1.01       16.99
1    Male  1.66       10.34
4  Female  3.61       24.59

In [37]:
df.loc[df['tip']==1.66,'total_bill'].values[0]

10.34

In [38]:
df.loc[df['tip']==1.66,'total_bill']

1    10.34
Name: total_bill, dtype: float64

In [41]:
df['tip']==1.66

0    False
1     True
2    False
3    False
4    False
Name: tip, dtype: bool

In [44]:
df.loc[df['tip']==1.66,'total_bill'].values[0]

10.34